var recommendInfo = {
	"title":"文章推荐",
	"recommList":[
		{
			"link": "#",
			"title":"Python爬虫实战一之爬取糗事百科段子1"
		},
		{
			"link": "#",
			"title":"Python爬虫实战一之爬取糗事百科段子2"
		},
		{
			"link": "#",
			"title":"Python爬虫实战一之爬取糗事百科段子3"
		},
		{
			"link": "#",
			"title":"Python爬虫实战一之爬取糗事百科段子4"
		},
		{
			"link": "#",
			"title":"Python爬虫实战一之爬取糗事百科段子5"
		},
		{
			"link": "#",
			"title":"Python爬虫实战一之爬取糗事百科段子6"
		}
	]
}

var friendLinkInfo = {
	"title":"友谊小屋",
	"links":[ 
		{
			"link":"#",
			"name":"刘亦菲"
		},
		{
			"link":"#",
			"name":"迪丽热巴"
		},
		{
			"link":"#",
			"name":"古力娜扎"
		},
		{
			"link":"#",
			"name":"玛克西姆·高尔基"
		},
		{
			"link":"#",
			"name":"马云"
		},
		{
			"link":"#",
			"name":"李彦宏"
		},
	]
}

var categoryInfo = {
 	"info": [
 		{
 			"link":"index.html",
 			"name":"HTML",
 			"num":23
 		},
 		{
 			"link":"index.html",
 			"name":"CSS",
 			"num":34
 		},
 		{
 			"link":"index.html",
 			"name":"JavaScript",
 			"num":30
 		},
 		{
 			"link":"index.html",
 			"name":"NodeJS",
 			"num":19
 		},
 		{
 			"link":"index.html",
 			"name":"PHP",
 			"num":9
 		},
 		{
 			"link":"index.html",
 			"name":"Canvas",
 			"num":18
 		},
 		{
 			"link":"index.html",
 			"name":"小程序",
 			"num":23
 		},
 	]
}

var articalArr = [{
		"id":1,
		"time":"2016/8/16 16:01",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"#",
		"img":"img/01.jpg",
		"title":"1坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-4-27",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/1.png",
		"title":"2坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-4-28",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/bg3.jpg",
		"title":"3坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		
		"id":1,
		"time":"2016-5-04",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/003.jpg",
		"title":"4坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-5-16",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/2.jpg",
		"title":"5坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-5-17",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/2.jpg",
		"title":"6坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-5-29",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/1.png",
		"title":"7坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-3-27",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/01.jpg",
		"title":"8坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-3-27",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/01.jpg",
		"title":"9坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-3-27",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/01.jpg",
		"title":"10坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-3-27",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/01.jpg",
		"title":"11坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-3-27",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/01.jpg",
		"title":"12坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	},
	{
		"id":1,
		"time":"2016-3-27",
		"user":"安妮小雅",
		"views":148,
		"likes":35,
		"link":"artical.html",
		"img":"img/01.jpg",
		"title":"13坦然面对前端的疲劳",
		"intro":"我是简介我是简介我是简介我是简介",
		"content":"招聘广告的解释 只要记住，会变好的。我所做的每一项工作，我都觉得自己不够深入，但最终你会习惯他们的工具和工作流程，你会学习并成为一个更好的开发人员。 不要害怕在工作中学习，掌握新技能的最佳方法是每天使用它们。 如果你有冒充者综合征，可能你是个正派的开发者，否则你就不会自觉地意识到它。 巩固基础 人们很容易被耀眼的新事物分心，但是如果你的基础还不牢固，那么你所建造的东西将经受不住时间的考验。 就像我的一个好朋友曾经对我说的： “专注于基础一直是我的口头禅。你能建立良好的项目（SH！T）和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。” 例如，当react一跃成名，它似乎总是和ES6捆绑在一起，我把重点放在语言的那些改变和新特性上而不是框架本身的细微差别。一旦react不火了，我从最新的JavaScript上学到的知识将继续存在下去。你可以在原生chrome玩很多特性，而不用引入Ba",
		"category":"JavaScript"	
	}
];
var skill = [
	{
		"name":"HTML",
		"size":88
	},
	{
		"name":"CSS",
		"size":80
	},
	{
		"name":"JavaScript",
		"size":76
	},
	{
		"name":"jQuery",
		"size":60
	},
	{
		"name":"移动端",
		"size":70
	},
	{
		"name":"Less/Sass",
		"size":80
	},
	{
		"name":"PHP",
		"size":60
	}
];

var curArtical ;
